# Pandas:

### A python lib. which is used for data manipulation, data analysis and data cleaning.

### use of pandas: recommendation system, economics, stock prediction, neuroscience,statistics,analytics etc.

### DataFrame: 2-d, mutable size, heterogeneous tabular data. Contains labeled axes (rows,col),in which we can perform arithmetic operation as well.


### Series: 1-d array, capable of holding data of any type.

In [2]:
import pandas as pd
import numpy as np

In [3]:
s = pd.Series([1,2,3,4,np.nan,7,8,9]) # series

In [4]:
s

0    1.0
1    2.0
2    3.0
3    4.0
4    NaN
5    7.0
6    8.0
7    9.0
dtype: float64

In [5]:
d = pd.date_range('20200525',periods = 10) # getting date range

In [6]:
d

DatetimeIndex(['2020-05-25', '2020-05-26', '2020-05-27', '2020-05-28',
               '2020-05-29', '2020-05-30', '2020-05-31', '2020-06-01',
               '2020-06-02', '2020-06-03'],
              dtype='datetime64[ns]', freq='D')

In [7]:
df = pd.DataFrame(np.random.randn(10,4),index = d,columns = ['A','B','C','D']) # dataframe

In [8]:
df

                   A         B         C         D
2020-05-25  0.991981  1.615888 -0.296997 -0.400111
2020-05-26  0.768326  0.300476 -1.553762 -0.224009
2020-05-27 -0.673708  0.141254 -0.729661  0.500395
2020-05-28  0.650358  0.283608  1.391745 -0.374394
2020-05-29 -0.763201 -0.845664  0.519668  0.876082
2020-05-30 -0.353572 -0.297080  0.258634  1.657337
2020-05-31 -0.323465 -1.044875 -1.189846  1.165950
2020-06-01 -1.030814 -0.133547  1.208483  0.018312
2020-06-02  0.692838 -0.621512 -0.177550 -0.728433
2020-06-03  0.938457  0.293652 -1.635967  0.157466

In [9]:
df1 = pd.DataFrame({'A':[1,2,3,4],                                                 # creating df using dict
                   'B':pd.Timestamp('20200525'),
                   'C':pd.Series(1,index = list(range(4)),dtype = 'float32'),
                   'D':np.array([5]*4,dtype = 'int32'),
                   'E':pd.Categorical(['true','false','true','false']),
                   'F':'Edureka'})

In [10]:
df1

   A          B    C  D      E        F
0  1 2020-05-25  1.0  5   true  Edureka
1  2 2020-05-25  1.0  5  false  Edureka
2  3 2020-05-25  1.0  5   true  Edureka
3  4 2020-05-25  1.0  5  false  Edureka

In [11]:
df1.dtypes

A             int64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

## How to view data ?

In [12]:
df.head() # first 5 value

                   A         B         C         D
2020-05-25  0.991981  1.615888 -0.296997 -0.400111
2020-05-26  0.768326  0.300476 -1.553762 -0.224009
2020-05-27 -0.673708  0.141254 -0.729661  0.500395
2020-05-28  0.650358  0.283608  1.391745 -0.374394
2020-05-29 -0.763201 -0.845664  0.519668  0.876082

In [13]:
df.tail() # last 5 value

                   A         B         C         D
2020-05-30 -0.353572 -0.297080  0.258634  1.657337
2020-05-31 -0.323465 -1.044875 -1.189846  1.165950
2020-06-01 -1.030814 -0.133547  1.208483  0.018312
2020-06-02  0.692838 -0.621512 -0.177550 -0.728433
2020-06-03  0.938457  0.293652 -1.635967  0.157466

In [14]:
df.index # get index

DatetimeIndex(['2020-05-25', '2020-05-26', '2020-05-27', '2020-05-28',
               '2020-05-29', '2020-05-30', '2020-05-31', '2020-06-01',
               '2020-06-02', '2020-06-03'],
              dtype='datetime64[ns]', freq='D')

In [15]:
df.columns # get columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [16]:
df.to_numpy()  # creating np array from pd (fast)

array([[ 0.99198149,  1.61588803, -0.29699726, -0.40011107],
       [ 0.76832569,  0.30047631, -1.55376152, -0.22400944],
       [-0.67370819,  0.1412542 , -0.72966066,  0.50039463],
       [ 0.65035773,  0.28360776,  1.39174505, -0.374394  ],
       [-0.76320117, -0.84566395,  0.51966807,  0.87608208],
       [-0.35357156, -0.29707954,  0.25863427,  1.65733707],
       [-0.32346514, -1.04487463, -1.18984579,  1.16594952],
       [-1.03081379, -0.13354681,  1.20848274,  0.01831249],
       [ 0.69283836, -0.6215123 , -0.17754993, -0.72843268],
       [ 0.93845675,  0.2936515 , -1.63596665,  0.15746579]])

In [17]:
df.describe() # short describing data

               A          B          C          D
count  10.000000  10.000000  10.000000  10.000000
mean    0.089720  -0.030780  -0.220525   0.264859
std     0.789242   0.758493   1.075301   0.769473
min    -1.030814  -1.044875  -1.635967  -0.728433
25%    -0.593674  -0.540404  -1.074800  -0.336798
50%     0.163446   0.003854  -0.237274   0.087889
75%     0.749454   0.291141   0.454410   0.782160
max     0.991981   1.615888   1.391745   1.657337

In [18]:
df.sort_index(axis = 1,ascending = False)  # sorting the column or index

                   D         C         B         A
2020-05-25 -0.400111 -0.296997  1.615888  0.991981
2020-05-26 -0.224009 -1.553762  0.300476  0.768326
2020-05-27  0.500395 -0.729661  0.141254 -0.673708
2020-05-28 -0.374394  1.391745  0.283608  0.650358
2020-05-29  0.876082  0.519668 -0.845664 -0.763201
2020-05-30  1.657337  0.258634 -0.297080 -0.353572
2020-05-31  1.165950 -1.189846 -1.044875 -0.323465
2020-06-01  0.018312  1.208483 -0.133547 -1.030814
2020-06-02 -0.728433 -0.177550 -0.621512  0.692838
2020-06-03  0.157466 -1.635967  0.293652  0.938457

In [19]:
df.sort_values(by = 'C',ascending = True) # sort all values by index 'C'

                   A         B         C         D
2020-06-03  0.938457  0.293652 -1.635967  0.157466
2020-05-26  0.768326  0.300476 -1.553762 -0.224009
2020-05-31 -0.323465 -1.044875 -1.189846  1.165950
2020-05-27 -0.673708  0.141254 -0.729661  0.500395
2020-05-25  0.991981  1.615888 -0.296997 -0.400111
2020-06-02  0.692838 -0.621512 -0.177550 -0.728433
2020-05-30 -0.353572 -0.297080  0.258634  1.657337
2020-05-29 -0.763201 -0.845664  0.519668  0.876082
2020-06-01 -1.030814 -0.133547  1.208483  0.018312
2020-05-28  0.650358  0.283608  1.391745 -0.374394

In [20]:
df['D'] # get single column from df

2020-05-25   -0.400111
2020-05-26   -0.224009
2020-05-27    0.500395
2020-05-28   -0.374394
2020-05-29    0.876082
2020-05-30    1.657337
2020-05-31    1.165950
2020-06-01    0.018312
2020-06-02   -0.728433
2020-06-03    0.157466
Freq: D, Name: D, dtype: float64

In [21]:
df[0:3]  # get data rowwise

                   A         B         C         D
2020-05-25  0.991981  1.615888 -0.296997 -0.400111
2020-05-26  0.768326  0.300476 -1.553762 -0.224009
2020-05-27 -0.673708  0.141254 -0.729661  0.500395

In [22]:
df[2:6] # get data rowwise

                   A         B         C         D
2020-05-27 -0.673708  0.141254 -0.729661  0.500395
2020-05-28  0.650358  0.283608  1.391745 -0.374394
2020-05-29 -0.763201 -0.845664  0.519668  0.876082
2020-05-30 -0.353572 -0.297080  0.258634  1.657337

In [23]:
df.loc[d[0]]  # get data location wise ...d --> label

A    0.991981
B    1.615888
C   -0.296997
D   -0.400111
Name: 2020-05-25 00:00:00, dtype: float64

In [24]:
df.loc[:,['B','C']] # get data on a multiaccess by label

                   B         C
2020-05-25  1.615888 -0.296997
2020-05-26  0.300476 -1.553762
2020-05-27  0.141254 -0.729661
2020-05-28  0.283608  1.391745
2020-05-29 -0.845664  0.519668
2020-05-30 -0.297080  0.258634
2020-05-31 -1.044875 -1.189846
2020-06-01 -0.133547  1.208483
2020-06-02 -0.621512 -0.177550
2020-06-03  0.293652 -1.635967

In [25]:
df.loc['20200527':'20200601',['B','C']]  # get data by taking label range

                   B         C
2020-05-27  0.141254 -0.729661
2020-05-28  0.283608  1.391745
2020-05-29 -0.845664  0.519668
2020-05-30 -0.297080  0.258634
2020-05-31 -1.044875 -1.189846
2020-06-01 -0.133547  1.208483

In [26]:
df.loc['20200525',['B','C']] # GET DATA BY TAKING SINGLE LABEL

B    1.615888
C   -0.296997
Name: 2020-05-25 00:00:00, dtype: float64

In [27]:
df.at[d[0],'B']  # getting single value

1.6158880316206818

In [28]:
df.at[d[0],'C'] # getting single value

-0.2969972626103221

In [29]:
df.iloc[0] # get data by indexed location

A    0.991981
B    1.615888
C   -0.296997
D   -0.400111
Name: 2020-05-25 00:00:00, dtype: float64

In [30]:
df.iloc[0:2] # get data by indexed location

                   A         B         C         D
2020-05-25  0.991981  1.615888 -0.296997 -0.400111
2020-05-26  0.768326  0.300476 -1.553762 -0.224009

In [31]:
df.iloc[0:2,0:2] # get data by indexed location

                   A         B
2020-05-25  0.991981  1.615888
2020-05-26  0.768326  0.300476

In [32]:
df[df['A'] > 0]  # boolean indexing (imp) # like a fn giving values of column 'A' > 0

                   A         B         C         D
2020-05-25  0.991981  1.615888 -0.296997 -0.400111
2020-05-26  0.768326  0.300476 -1.553762 -0.224009
2020-05-28  0.650358  0.283608  1.391745 -0.374394
2020-06-02  0.692838 -0.621512 -0.177550 -0.728433
2020-06-03  0.938457  0.293652 -1.635967  0.157466

In [33]:
df[df['B'] > 2]

Empty DataFrame
Columns: [A, B, C, D]
Index: []

## Handling missing data 

#### missing data or null values can create lots of problem during data science life cycle. it is challenging to handle misssing data.

In [34]:
df2 = df.reindex(index = d[0:4],columns = list(df.columns) + ['E']) 
# reindex the df where we take first 4 index(rows),all columns + 1 extra column

In [35]:
df2.loc[d[0]:d[1],['E']] = 1  # set the first two row value of new col is 1

In [36]:
df2

                   A         B         C         D    E
2020-05-25  0.991981  1.615888 -0.296997 -0.400111  1.0
2020-05-26  0.768326  0.300476 -1.553762 -0.224009  1.0
2020-05-27 -0.673708  0.141254 -0.729661  0.500395  NaN
2020-05-28  0.650358  0.283608  1.391745 -0.374394  NaN

In [37]:
df2.isnull()  # check null values

                A      B      C      D      E
2020-05-25  False  False  False  False  False
2020-05-26  False  False  False  False  False
2020-05-27  False  False  False  False   True
2020-05-28  False  False  False  False   True

In [38]:
df2.isna() # check null values

                A      B      C      D      E
2020-05-25  False  False  False  False  False
2020-05-26  False  False  False  False  False
2020-05-27  False  False  False  False   True
2020-05-28  False  False  False  False   True

In [39]:
df2.isnull().sum()  # get count of null values of each col

A    0
B    0
C    0
D    0
E    2
dtype: int64

In [40]:
df2.fillna(value = 2)  # fill the value=2 in place of nan

                   A         B         C         D    E
2020-05-25  0.991981  1.615888 -0.296997 -0.400111  1.0
2020-05-26  0.768326  0.300476 -1.553762 -0.224009  1.0
2020-05-27 -0.673708  0.141254 -0.729661  0.500395  2.0
2020-05-28  0.650358  0.283608  1.391745 -0.374394  2.0

## Pandas Operations

#### Descriptive statistiics, applying fn , string processing , histogramming.

In [41]:
df

                   A         B         C         D
2020-05-25  0.991981  1.615888 -0.296997 -0.400111
2020-05-26  0.768326  0.300476 -1.553762 -0.224009
2020-05-27 -0.673708  0.141254 -0.729661  0.500395
2020-05-28  0.650358  0.283608  1.391745 -0.374394
2020-05-29 -0.763201 -0.845664  0.519668  0.876082
2020-05-30 -0.353572 -0.297080  0.258634  1.657337
2020-05-31 -0.323465 -1.044875 -1.189846  1.165950
2020-06-01 -1.030814 -0.133547  1.208483  0.018312
2020-06-02  0.692838 -0.621512 -0.177550 -0.728433
2020-06-03  0.938457  0.293652 -1.635967  0.157466

In [42]:
df.mean()  # mean val col wise

A    0.089720
B   -0.030780
C   -0.220525
D    0.264859
dtype: float64

In [43]:
df.mean(1) # mean val row wise

2020-05-25    0.477690
2020-05-26   -0.177242
2020-05-27   -0.190430
2020-05-28    0.487829
2020-05-29   -0.053279
2020-05-30    0.316330
2020-05-31   -0.348059
2020-06-01    0.015609
2020-06-02   -0.208664
2020-06-03   -0.061598
Freq: D, dtype: float64

In [44]:
s = pd.Series([1,2,3,np.nan,4,5,6,7,8,9],index = d)

In [45]:
s

2020-05-25    1.0
2020-05-26    2.0
2020-05-27    3.0
2020-05-28    NaN
2020-05-29    4.0
2020-05-30    5.0
2020-05-31    6.0
2020-06-01    7.0
2020-06-02    8.0
2020-06-03    9.0
Freq: D, dtype: float64

In [46]:
s = s.shift(2)  # shifting the value of s by 2 (rowwise)
s

2020-05-25    NaN
2020-05-26    NaN
2020-05-27    1.0
2020-05-28    2.0
2020-05-29    3.0
2020-05-30    NaN
2020-05-31    4.0
2020-06-01    5.0
2020-06-02    6.0
2020-06-03    7.0
Freq: D, dtype: float64

In [47]:
df.sub(s,axis = 'index')

                   A         B         C         D
2020-05-25       NaN       NaN       NaN       NaN
2020-05-26       NaN       NaN       NaN       NaN
2020-05-27 -1.673708 -0.858746 -1.729661 -0.499605
2020-05-28 -1.349642 -1.716392 -0.608255 -2.374394
2020-05-29 -3.763201 -3.845664 -2.480332 -2.123918
2020-05-30       NaN       NaN       NaN       NaN
2020-05-31 -4.323465 -5.044875 -5.189846 -2.834050
2020-06-01 -6.030814 -5.133547 -3.791517 -4.981688
2020-06-02 -5.307162 -6.621512 -6.177550 -6.728433
2020-06-03 -6.061543 -6.706348 -8.635967 -6.842534

In [48]:
df

                   A         B         C         D
2020-05-25  0.991981  1.615888 -0.296997 -0.400111
2020-05-26  0.768326  0.300476 -1.553762 -0.224009
2020-05-27 -0.673708  0.141254 -0.729661  0.500395
2020-05-28  0.650358  0.283608  1.391745 -0.374394
2020-05-29 -0.763201 -0.845664  0.519668  0.876082
2020-05-30 -0.353572 -0.297080  0.258634  1.657337
2020-05-31 -0.323465 -1.044875 -1.189846  1.165950
2020-06-01 -1.030814 -0.133547  1.208483  0.018312
2020-06-02  0.692838 -0.621512 -0.177550 -0.728433
2020-06-03  0.938457  0.293652 -1.635967  0.157466

In [49]:
df.apply(np.cumsum) # apply fn to get cumulative sum

                   A         B         C         D
2020-05-25  0.991981  1.615888 -0.296997 -0.400111
2020-05-26  1.760307  1.916364 -1.850759 -0.624121
2020-05-27  1.086599  2.057619 -2.580419 -0.123726
2020-05-28  1.736957  2.341226 -1.188674 -0.498120
2020-05-29  0.973756  1.495562 -0.669006  0.377962
2020-05-30  0.620184  1.198483 -0.410372  2.035299
2020-05-31  0.296719  0.153608 -1.600218  3.201249
2020-06-01 -0.734095  0.020061 -0.391735  3.219561
2020-06-02 -0.041257 -0.601451 -0.569285  2.491129
2020-06-03  0.897200 -0.307799 -2.205252  2.648594

In [50]:
df.apply(lambda x: max(x) - min(x)) # apply lambda fn to get max-min value of each col

A    2.022795
B    2.660763
C    3.027712
D    2.385770
dtype: float64

In [51]:
df.apply(lambda x: max(x)) # apply lambda fn to get max value of each col

A    0.991981
B    1.615888
C    1.391745
D    1.657337
dtype: float64

In [52]:
s

2020-05-25    NaN
2020-05-26    NaN
2020-05-27    1.0
2020-05-28    2.0
2020-05-29    3.0
2020-05-30    NaN
2020-05-31    4.0
2020-06-01    5.0
2020-06-02    6.0
2020-06-03    7.0
Freq: D, dtype: float64

In [53]:
s.value_counts()  # get count of each non null values

7.0    1
6.0    1
5.0    1
4.0    1
3.0    1
2.0    1
1.0    1
dtype: int64

In [54]:
s1 = pd.Series(['edureka','python','jupyter',np.nan,'football','world']) # creating series having string values

In [55]:
s1

0     edureka
1      python
2     jupyter
3         NaN
4    football
5       world
dtype: object

In [56]:
s1.str.upper() # all upper case

0     EDUREKA
1      PYTHON
2     JUPYTER
3         NaN
4    FOOTBALL
5       WORLD
dtype: object

In [57]:
s1.str.lower() # all lower case

0     edureka
1      python
2     jupyter
3         NaN
4    football
5       world
dtype: object

In [58]:
s1.str.capitalize() # first letter capital

0     Edureka
1      Python
2     Jupyter
3         NaN
4    Football
5       World
dtype: object

In [59]:
s1.str.isnumeric()

0    False
1    False
2    False
3      NaN
4    False
5    False
dtype: object

#####  by clicking on tab after s1.str., we can get many fn of strings.

## merging 

### merge 2 df together

In [60]:
df1 = pd.DataFrame(np.random.randn(10,4))

In [61]:
df1

          0         1         2         3
0 -0.524182  0.921088  0.109704 -1.641461
1 -1.396997 -0.262049 -1.021408  0.722611
2  0.258444 -0.695070  0.550972 -0.436340
3  0.492662  0.776347 -0.341992 -0.559708
4  0.455072  0.701672  0.317695 -0.760406
5 -1.050981 -0.421697 -0.659777  0.848591
6 -0.053892 -0.426898 -0.309422  0.448815
7 -0.319998 -0.730562  0.894824 -2.061153
8 -0.222252 -1.060859 -1.220988  0.145869
9  0.260910 -0.145777  1.160061 -0.506256

In [62]:
df2 = [df1[0:3],df1[3:7],df1[7:]]  # df2 is data splitted in several pieces

In [63]:
df2

[          0         1         2         3
 0 -0.524182  0.921088  0.109704 -1.641461
 1 -1.396997 -0.262049 -1.021408  0.722611
 2  0.258444 -0.695070  0.550972 -0.436340,
           0         1         2         3
 3  0.492662  0.776347 -0.341992 -0.559708
 4  0.455072  0.701672  0.317695 -0.760406
 5 -1.050981 -0.421697 -0.659777  0.848591
 6 -0.053892 -0.426898 -0.309422  0.448815,
           0         1         2         3
 7 -0.319998 -0.730562  0.894824 -2.061153
 8 -0.222252 -1.060859 -1.220988  0.145869
 9  0.260910 -0.145777  1.160061 -0.506256]

In [64]:
pd.concat(df2) # join all data of df2

          0         1         2         3
0 -0.524182  0.921088  0.109704 -1.641461
1 -1.396997 -0.262049 -1.021408  0.722611
2  0.258444 -0.695070  0.550972 -0.436340
3  0.492662  0.776347 -0.341992 -0.559708
4  0.455072  0.701672  0.317695 -0.760406
5 -1.050981 -0.421697 -0.659777  0.848591
6 -0.053892 -0.426898 -0.309422  0.448815
7 -0.319998 -0.730562  0.894824 -2.061153
8 -0.222252 -1.060859 -1.220988  0.145869
9  0.260910 -0.145777  1.160061 -0.506256

In [74]:
left = pd.DataFrame({'a':[1,2],'b':[3,4]},index=['k1','k2'])
left

    a  b
k1  1  3
k2  2  4

In [75]:
right = pd.DataFrame({'a':[3,6],'f':[2,2]},index=['k3','k2'])
right

    a  f
k3  3  2
k2  6  2

In [76]:
left.merge(right,on = 'a',how ='inner')

Empty DataFrame
Columns: [a, b, f]
Index: []

In [77]:
left.merge(right,on = 'a',how ='left')

   a  b   f
0  1  3 NaN
1  2  4 NaN

In [78]:
left.merge(right,on = 'a',how ='right')

   a   b  f
0  3 NaN  2
1  6 NaN  2

In [79]:
left.merge(right,on = 'a',how ='outer')

   a    b    f
0  1  3.0  NaN
1  2  4.0  NaN
2  3  NaN  2.0
3  6  NaN  2.0

In [80]:
left.index

Index(['k1', 'k2'], dtype='object')

In [81]:
right.index

Index(['k3', 'k2'], dtype='object')

In [85]:
right2 = pd.DataFrame({'e':[3,6],'f':[2,2]},index=['k3','k2'])
right2

    e  f
k3  3  2
k2  6  2

In [86]:
left

    a  b
k1  1  3
k2  2  4

## Join

In [83]:
left.join(right2,how = 'inner')

    a  b  e  f
k2  2  4  6  2

In [87]:
left.join(right2,how = 'left')

    a  b    e    f
k1  1  3  NaN  NaN
k2  2  4  6.0  2.0

In [88]:
left.join(right2,how = 'right')

      a    b  e  f
k3  NaN  NaN  3  2
k2  2.0  4.0  6  2

In [89]:
left.join(right2,how = 'outer')

      a    b    e    f
k1  1.0  3.0  NaN  NaN
k2  2.0  4.0  6.0  2.0
k3  NaN  NaN  3.0  2.0

In [90]:
df

                   A         B         C         D
2020-05-25  0.991981  1.615888 -0.296997 -0.400111
2020-05-26  0.768326  0.300476 -1.553762 -0.224009
2020-05-27 -0.673708  0.141254 -0.729661  0.500395
2020-05-28  0.650358  0.283608  1.391745 -0.374394
2020-05-29 -0.763201 -0.845664  0.519668  0.876082
2020-05-30 -0.353572 -0.297080  0.258634  1.657337
2020-05-31 -0.323465 -1.044875 -1.189846  1.165950
2020-06-01 -1.030814 -0.133547  1.208483  0.018312
2020-06-02  0.692838 -0.621512 -0.177550 -0.728433
2020-06-03  0.938457  0.293652 -1.635967  0.157466

In [92]:
df.groupby('A').sum() # grouping value acc to 'A'

                  B         C         D
A
-1.030814 -0.133547  1.208483  0.018312
-0.763201 -0.845664  0.519668  0.876082
-0.673708  0.141254 -0.729661  0.500395
-0.353572 -0.297080  0.258634  1.657337
-0.323465 -1.044875 -1.189846  1.165950
 0.650358  0.283608  1.391745 -0.374394
 0.692838 -0.621512 -0.177550 -0.728433
 0.768326  0.300476 -1.553762 -0.224009
 0.938457  0.293652 -1.635967  0.157466
 0.991981  1.615888 -0.296997 -0.400111

In [93]:
df.groupby('D').sum()

                  A         B         C
D
-0.728433  0.692838 -0.621512 -0.177550
-0.400111  0.991981  1.615888 -0.296997
-0.374394  0.650358  0.283608  1.391745
-0.224009  0.768326  0.300476 -1.553762
 0.018312 -1.030814 -0.133547  1.208483
 0.157466  0.938457  0.293652 -1.635967
 0.500395 -0.673708  0.141254 -0.729661
 0.876082 -0.763201 -0.845664  0.519668
 1.165950 -0.323465 -1.044875 -1.189846
 1.657337 -0.353572 -0.297080  0.258634

In [94]:
df.groupby(['A','D']).sum()

                            B         C
A         D
-1.030814  0.018312 -0.133547  1.208483
-0.763201  0.876082 -0.845664  0.519668
-0.673708  0.500395  0.141254 -0.729661
-0.353572  1.657337 -0.297080  0.258634
-0.323465  1.165950 -1.044875 -1.189846
 0.650358 -0.374394  0.283608  1.391745
 0.692838 -0.728433 -0.621512 -0.177550
 0.768326 -0.224009  0.300476 -1.553762
 0.938457  0.157466  0.293652 -1.635967
 0.991981 -0.400111  1.615888 -0.296997

## Reshaping the data

### stack & pivot table

In [95]:
# perform multiindexing

my_tuple = list(zip(*[[1,2,3,4,5,6,7,8],[9,10,11,12,13,14,15,16]]))  # create index values
my_tuple

[(1, 9), (2, 10), (3, 11), (4, 12), (5, 13), (6, 14), (7, 15), (8, 16)]

In [96]:
index = pd.MultiIndex.from_tuples(my_tuple,names = ['I','II']) # name the index values
index

MultiIndex([(1,  9),
            (2, 10),
            (3, 11),
            (4, 12),
            (5, 13),
            (6, 14),
            (7, 15),
            (8, 16)],
           names=['I', 'II'])

In [98]:
df3 = pd.DataFrame(np.random.randn(8,2),index = index, columns = ['A','B']) # create df
df3

             A         B
I II
1 9   0.293806 -1.513509
2 10 -0.792851  0.258148
3 11  0.798882  2.006009
4 12 -0.957366 -0.922992
5 13 -0.814250 -0.195453
6 14  0.449884  0.445039
7 15 -0.889170 -0.132681
8 16 -0.124617  0.737797

In [101]:
df4 = df3[:4]
df4

             A         B
I II
1 9   0.293806 -1.513509
2 10 -0.792851  0.258148
3 11  0.798882  2.006009
4 12 -0.957366 -0.922992

In [103]:
my_tuple2 = list(zip(*[['Neha','Sneha','Ankit'],['n','s','a']]))
ind = pd.MultiIndex.from_tuples(my_tuple2,names = ['FullName','FirstLetter'])
df0 = pd.DataFrame(np.random.randn(3,3),index = ind,columns = ['val1','val2','val3'])
df0

                          val1      val2      val3
FullName FirstLetter
Neha     n           -1.372552  0.693284 -1.715673
Sneha    s           -0.459924  0.597233 -0.848712
Ankit    a            0.163820  0.806354 -0.380546

In [106]:
df00 = df0[1:2]
df00

                          val1      val2      val3
FullName FirstLetter
Sneha    s           -0.459924  0.597233 -0.848712

In [111]:
# stacking

x = df4.stack() # compress df column
x

I  II
1  9   A    0.293806
       B   -1.513509
2  10  A   -0.792851
       B    0.258148
3  11  A    0.798882
       B    2.006009
4  12  A   -0.957366
       B   -0.922992
dtype: float64

In [112]:
df0.stack()

FullName  FirstLetter
Neha      n            val1   -1.372552
                       val2    0.693284
                       val3   -1.715673
Sneha     s            val1   -0.459924
                       val2    0.597233
                       val3   -0.848712
Ankit     a            val1    0.163820
                       val2    0.806354
                       val3   -0.380546
dtype: float64

In [113]:
x.unstack()   # reverse of stack

             A         B
I II
1 9   0.293806 -1.513509
2 10 -0.792851  0.258148
3 11  0.798882  2.006009
4 12 -0.957366 -0.922992